In [5]:
# Importing the needed libraries
import pandas as pd
import numpy as np

In [6]:
# Loading the data
data = pd.read_csv("Sales_January_2019.csv")

In [7]:
data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"
...,...,...,...,...,...,...
9718,150497,20in Monitor,1,109.99,01/26/19 19:09,"95 8th St, Dallas, TX 75001"
9719,150498,27in FHD Monitor,1,149.99,01/10/19 22:58,"403 7th St, San Francisco, CA 94016"
9720,150499,ThinkPad Laptop,1,999.99,01/21/19 14:31,"214 Main St, Portland, OR 97035"
9721,150500,AAA Batteries (4-pack),2,2.99,01/15/19 14:21,"810 2nd St, Los Angeles, CA 90001"
9722,150501,Google Phone,1,600,01/13/19 16:43,"428 Cedar St, Boston, MA 02215"

In [20]:
data = [100, 20, 5, 20, 45, -100, 45]
data

[100, 20, 5, 20, 45, -100, 45]

In [21]:
# Calculating the mean
mean_ = np.mean(data)

In [22]:
mean_

19.285714285714285

In [24]:
# Calculating the median
median = np.median(data)
median

20.0

In [28]:
# Calculation of the mode
# we need scipy since numpy has no mode function
from scipy import stats

mode = stats.mode(data)
mode

ModeResult(mode=20, count=2)

In [30]:
# Calculation of the variance
# measures the disparsal of data quantifies how far your number 
# is from the mean.
var = np.var(data)
var

3181.632653061224

In [31]:
# Calculating the standard deviation
stdev = np.std(data)
stdev

56.40596292114181

In [32]:
data_csv = pd.read_csv('data.csv')

In [33]:
data_csv

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [36]:
data_csv[data_csv["Pulse"]>110].mean()

Duration     51.086957
Pulse       125.260870
Maxpulse    149.760870
Calories    366.313043
dtype: float64

In [39]:
std = np.std(data_csv["Pulse"])
std

14.467265641714365

In [40]:
# To print the descriptive statistical data of the data
data_csv.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [43]:
data1 = pd.DataFrame({
    "Key":['A', 'B', 'C', 'D', 'E', 'F', "G"],
    "Value1":[1, 2, 3, 4, 5, 6, 7]  
})

data2 = pd.DataFrame({
    "Key":["C", "D", "E", "F", "G", "H"],
    "Value2":[8, 9, 10, 11, 12, 13]
})

In [44]:
data1

  Key  Value1
0   A       1
1   B       2
2   C       3
3   D       4
4   E       5
5   F       6
6   G       7

In [45]:
data2

  Key  Value2
0   C       8
1   D       9
2   E      10
3   F      11
4   G      12
5   H      13

In [51]:
# Performing the inner join
merge_innerjoin = pd.merge(data1, data2, on="Key", how='inner')
merge_innerjoin

  Key  Value1  Value2
0   C       3       8
1   D       4       9
2   E       5      10
3   F       6      11
4   G       7      12

In [52]:
# performing left join
# returns the columns that are in Aleft table and matching 
# values in right table
merge_leftjoin = pd.merge(data1, data2, on="Key", how="left")

In [56]:
merge_leftjoin.fillna(" ")

  Key  Value1 Value2
0   A       1
1   B       2
2   C       3    8.0
3   D       4    9.0
4   E       5   10.0
5   F       6   11.0
6   G       7   12.0

In [59]:
# Performing the Right Join to the two data frames
# returns the columns that are in the right table 
# and matching values in left stable

merge_rightjoin = pd.merge(data1, data2, on="Key", how="right")
merge_rightjoin.fillna(" ")

  Key Value1  Value2
0   C    3.0       8
1   D    4.0       9
2   E    5.0      10
3   F    6.0      11
4   G    7.0      12
5   H             13

In [63]:
#  Left Anti Join
# Returns only Columns from the left Table

# indicators shows whether the observation was in table one or table two
merge_left_Anti = pd.merge(data1, data2, on="Key", how="left", indicator=True)
merge_left_Anti

  Key  Value1  Value2     _merge
0   A       1     NaN  left_only
1   B       2     NaN  left_only
2   C       3     8.0       both
3   D       4     9.0       both
4   E       5    10.0       both
5   F       6    11.0       both
6   G       7    12.0       both

In [93]:
# defining our left anti data
merge_left = pd.merge(data1, data2, on="Key", how="left", indicator=True)
merge_left_Anti_join = merge_left[merge_left["_merge"] == "left_only"]
merge_left_Anti_join

  Key  Value1  Value2     _merge
0   A       1     NaN  left_only
1   B       2     NaN  left_only

In [96]:
# Droping the indicators colum _merge
merge_left_Anti_join.drop("_merge", axis=1)

  Key  Value1  Value2
0   A       1     NaN
1   B       2     NaN

In [68]:
inner_merge = merge_left[merge_left["_merge"]=="both"]

In [98]:
inner_merge.drop("_merge", axis=1)

  Key  Value1  Value2
2   C       3     8.0
3   D       4     9.0
4   E       5    10.0
5   F       6    11.0
6   G       7    12.0

In [101]:
# Right Join with indicators
right_anti = pd.merge(data1, data2, on="Key", how="right", indicator=True)
right_anti_join = right_anti[right_anti["_merge"]=='right_only']
right_anti_join.drop("_merge", axis=1)

  Key  Value1  Value2
5   H     NaN      13